Update FSD_GP.md
